Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File            : main.c
  * Brief           : PlusCart(+) Firmware
  * Author          : Wolfgang Stubig <w.stubig@firmaplus.de>
  * Website         : https://gitlab.com/firmaplus/atari-2600-pluscart
  ******************************************************************************
  * (c) 2019 Wolfgang Stubig (Al_Nafuur)
  * based on: UnoCart2600 by Robin Edwards (ElectroTrains)
  *           https://github.com/robinhedwards/UnoCart-2600
  *           and
  *           UnoCart2600 fork by Christian Speckner (DirtyHairy)
  *           https://github.com/DirtyHairy/UnoCart-2600
  ******************************************************************************
  * This program is free software: you can redistribute it and/or modify
  * it under the terms of the GNU General Public License as published by
  * the Free Software Foundation, either version 3 of the License, or
  * (at your option) any later version.
  *
  * This program is distributed in the hope that it will be useful,
  * but WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program.  If not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <ctype.h>
#include <string.h>

#include "main.h"
#include "esp8266.h"
#include "flash.h"
#include "cartridge_io.h"
#include "cartridge_firmware.h"
#include "cartridge_emulation_ar.h"
#include "cartridge_detection.h"
#include "cartridge_emulation.h"
#include "cartridge_emulation_df.h"
#include "cartridge_emulation_bf.h"
#include "cartridge_emulation_sb.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

typedef struct {
	enum cart_base_type base_type;
	_Bool withSuperChip;
	_Bool withPlusFunctions;
	uint32_t flash_part_address;
} CART_TYPE;

typedef struct {
	const char *ext;
	CART_TYPE cart_type;
} EXT_TO_CART_TYPE_MAP;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

const EXT_TO_CART_TYPE_MAP ext_to_cart_type_map[]__attribute__((section(".flash01"))) = {
	{"ROM",  { base_type_None, FALSE, FALSE }},
	{"BIN",  { base_type_None, FALSE, FALSE }},
	{"A26",  { base_type_None, FALSE, FALSE }},
	{"2K",   { base_type_2K, FALSE, FALSE }},
	{"4K",   { base_type_4K, FALSE, FALSE }},
	{"4KS",  { base_type_4K, TRUE, FALSE }},
	{"F8",   { base_type_F8, FALSE, FALSE }},
	{"F6",   { base_type_F6, FALSE, FALSE }},
	{"F4",   { base_type_F4, FALSE, FALSE }},
	{"F8S",  { base_type_F8, TRUE, FALSE }},
	{"F6S",  { base_type_F6, TRUE, FALSE }},
	{"F4S",  { base_type_F4, TRUE, FALSE }},
	{"FE",   { base_type_FE, FALSE, FALSE }},
	{"3F",   { base_type_3F, FALSE, FALSE }},
	{"3E",   { base_type_3E, FALSE, FALSE }},
	{"E0",   { base_type_E0, FALSE, FALSE }},
	{"084",  { base_type_0840, FALSE, FALSE }},
	{"CV",   { base_type_CV, FALSE, FALSE }},
	{"EF",   { base_type_EF, FALSE, FALSE }},
	{"EFS",  { base_type_EF, TRUE, FALSE }},
	{"F0",   { base_type_F0, FALSE, FALSE }},
	{"FA",   { base_type_FA, FALSE, FALSE }},
	{"E7",   { base_type_E7, FALSE, FALSE }},
	{"DPC",  { base_type_DPC, FALSE, FALSE }},
	{"AR",   { base_type_AR, FALSE, FALSE }},
	{"BF",   { base_type_BF, FALSE, FALSE }},
	{"BFS",  { base_type_BFSC, FALSE, FALSE }},
	{"ACE",  { base_type_ACE, FALSE, FALSE }},
	{"WD",   { base_type_PP, FALSE, FALSE }},
	{"DF",   { base_type_DF, FALSE, FALSE }},
	{"DFS",  { base_type_DFSC, FALSE, FALSE }},
	{"3EP",  { base_type_3EPlus, FALSE, FALSE }},
	{"DPCP", { base_type_DPCplus, FALSE, FALSE }},
	{"SB",   { base_type_SB, FALSE, FALSE }},

	{0,{0,0,0}}
};

static const char status_message[][28]__attribute__((section(".flash01"))) = {
		"PlusCart(+) by W.Stubig"          ,
		"PlusCart(+) Ver. " VERSION        ,
		"PlusCart(+)"                      ,
		"Select your WiFi Network"         ,
		"No WiFi"                          ,
		"WiFi connected"                   ,
		"Request timeout"                  ,
		"Insert WiFi Password"             ,
		"Insert email or username"         ,
		"Connected, email send"            ,
		"User created, email send"         ,
		"PlusStore connect failed"         ,
		"Disconnected from PlusStore"      ,
		"Insert Secret-Key"                ,
		"Secret-Key saved"                 ,
		"Offline ROMs erased"              ,
		"ROM file too big!"                ,
		"ACE is not supported"             ,
		"Unknown/invalid ROM"              ,
		"Done"                             ,
		"Failed"                           ,
		"Firmware download failed"         ,
		"Offline ROMs detected"            ,
		"No offline ROMs detected"         ,
		"DPC+ is not supported"
};


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;


/* USER CODE BEGIN PV */
int num_menu_entries = 0;
char http_request_header[512];

uint8_t buffer[BUFFER_SIZE * 1024];
unsigned int cart_size_bytes;

USER_SETTINGS user_settings;

char curPath[256];

uint8_t plus_store_status[1];

MENU_ENTRY menu_entries[NUM_MENU_ITEMS] __attribute__((section(".ccmram")));


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
enum e_status_message buildMenuFromPath( MENU_ENTRY * )__attribute__((section(".flash0"))) ;
void append_entry_to_path(MENU_ENTRY *);



/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */




/*************************************************************************
 * Menu Handling
 *************************************************************************/

char *get_filename_ext(char *filename) {
	char *dot = strrchr(filename, '.');
	if(!dot || dot == filename) return "";
	return (dot + 1);
}

