Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
void make_menu_entry( MENU_ENTRY **dst, char *name, int type){
	(*dst)->type = type;
	strcpy((*dst)->entryname, name);
	(*dst)->filesize = 0U;
	(*dst)++;
	num_menu_entries++;
}
void make_keyboard(MENU_ENTRY **dst){
	make_menu_entry(&(*dst), "(GO BACK)", Leave_Menu);
	make_menu_entry(&(*dst), "(DEL CHAR)", Delete_Keyboard_Char);
	char Key[2] = "0";
	for (char i=32; i < 100; i++){
		Key[0] = i;
		make_menu_entry(&(*dst), Key, Keyboard_Char);
	}
	make_menu_entry(&(*dst), "Enter", Menu_Action);

}

enum e_status_message buildMenuFromPath( MENU_ENTRY *d )  {
	int count = 0;
	_Bool loadStore = FALSE;
	_Bool is_entry_row;
	uint8_t pos = 0, c;
	num_menu_entries = 0;
	enum e_status_message menu_status = none;

	MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];

	if(strncmp(MENU_TEXT_SETUP, curPath, sizeof(MENU_TEXT_SETUP) - 1) == 0 ){
		//char *  curPathPos = (char *) &curPath[sizeof(MENU_TEXT_SETUP)];
		if(strlen(curPath) == sizeof(MENU_TEXT_SETUP) - 1 ){
			make_menu_entry(&dst, "(GO Back)", Leave_Menu);
			make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Setup_Menu);
			make_menu_entry(&dst, MENU_TEXT_WIFI_SETUP, Setup_Menu);
			make_menu_entry(&dst, MENU_TEXT_WPS_CONNECT, Menu_Action);
			make_menu_entry(&dst, MENU_TEXT_WIFI_MANGER, Menu_Action);
			//make_menu_entry(&dst, MENU_TEXT_PRIVATE_KEY, Input_Field);
			make_menu_entry(&dst, MENU_TEXT_ESP8266_RESTORE, Menu_Action);

			if(	flash_has_downloaded_roms() )
	    		make_menu_entry(&dst, MENU_TEXT_DELETE_OFFLINE_ROMS, Menu_Action);
			else
	    		make_menu_entry(&dst, MENU_TEXT_DETECT_OFFLINE_ROMS, Menu_Action);

        	menu_status = version;
			loadStore = TRUE;
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WIFI_SETUP, sizeof(MENU_TEXT_WIFI_SETUP) - 1) == 0 ){
			if(strlen(curPath) > sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) ){
				if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
					// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" SSID[33] + Password + "/Enter" + '\0'
					curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path

					// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
					int i = sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP);
			        while( curPath[i] != 30 && i < ( sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 31) ){
			            i++;
			        }
			        curPath[i] = 0;

			    	if(esp8266_wifi_connect( &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP)  ], &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 32])){
			        	menu_status = wifi_connected;
			    	}else{
			        	menu_status = wifi_not_connected;
			    	}
					curPath[0] = '\0';
				}else{
					if(d->type == Setup_Menu){
						menu_status = insert_password;
					}
					make_keyboard(&dst);
				}

			}else{
				menu_status = select_wifi_network;
				make_menu_entry(&dst, "(GO BACK)", Leave_Menu);
				if( esp8266_wifi_list( &dst, &num_menu_entries) == FALSE){
		    		return esp_timeout;
		    	}
			}
		}else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_TV_MODE_SETUP, sizeof(MENU_TEXT_TV_MODE_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){
				uint8_t new_tv_mode = TV_MODE_NTSC;
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_PAL) == 0){
					new_tv_mode = TV_MODE_PAL;
				}else if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_PAL60) == 0){
					new_tv_mode = TV_MODE_PAL60;
				}
				set_tv_mode(new_tv_mode);
				if(user_settings.tv_mode != new_tv_mode){
					user_settings.tv_mode = new_tv_mode;
					flash_set_eeprom_user_settings(user_settings);
				}
	        	curPath[0] = '\0';
			}else{
				make_menu_entry(&dst, "(GO Back)", Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_PAL, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_PAL60, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_NTSC, Menu_Action);
			}

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT, sizeof(MENU_TEXT_PLUS_CONNECT) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user
				if( esp8266_PlusStore_API_connect() == FALSE){
					return esp_timeout;
				}
				esp8266_PlusStore_API_prepare_request_header(curPath, FALSE, TRUE );
	        	esp8266_print(http_request_header);
	        	esp8266_skip_http_response_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}
	        	if(c == '0'){
	        		menu_status = plus_connect_failed;
	        	}else if(c == '1'){
	        		menu_status = plus_created;
	        	}else{
	        		menu_status = plus_connected;
	        	}

	        	esp8266_PlusStore_API_end_transmission();

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT) == 0){
					menu_status = plus_connect;
				}
				make_keyboard(&dst);
			}
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_REMOVE, sizeof(MENU_TEXT_PLUS_REMOVE) - 1) == 0 ){
			if( esp8266_PlusStore_API_connect() == FALSE){
				return esp_timeout;
			}
			esp8266_PlusStore_API_prepare_request_header(curPath, FALSE, TRUE );
        	esp8266_print(http_request_header);

            esp8266_skip_http_response_header();
        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}
        	if(c == '0'){
        		menu_status = plus_connect_failed;
        	}else{
        		menu_status = plus_removed;
        	}

        	esp8266_PlusStore_API_end_transmission();

        	curPath[0] = '\0';

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_OFFLINE_ROM_UPDATE, sizeof(MENU_TEXT_OFFLINE_ROM_UPDATE) - 1) == 0 ){
			if( flash_download("&r=1", d->filesize , 0 , FALSE ) != DOWNLOAD_AREA_START_ADDRESS){
		    	menu_status = download_failed;
			}else{
	    		menu_status = done;
	        	curPath[0] = '\0';
			}
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_DELETE_OFFLINE_ROMS, sizeof(MENU_TEXT_DELETE_OFFLINE_ROMS) - 1) == 0 ){
			flash_erase_storage((uint8_t)FLASH_SECTOR_5);
			user_settings.first_free_flash_sector = (uint8_t) FLASH_SECTOR_5;
		    flash_set_eeprom_user_settings(user_settings);
    		menu_status = offline_roms_deleted;
        	curPath[0] = '\0';
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_DETECT_OFFLINE_ROMS, sizeof(MENU_TEXT_DELETE_OFFLINE_ROMS) - 1) == 0 ){
			uint32_t last_address = flash_check_offline_roms_size();
			if(last_address > DOWNLOAD_AREA_START_ADDRESS + 1024){
			    user_settings.first_free_flash_sector = ((last_address - ADDR_FLASH_SECTOR_5) / 0x20000 ) + 6;
			    flash_set_eeprom_user_settings(user_settings);
	    		menu_status = offline_roms_detected;
			}else{
	    		menu_status = no_offline_roms_detected;
			}
    		num_menu_entries = 0;
        	curPath[0] = '\0';
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WPS_CONNECT, sizeof(MENU_TEXT_WPS_CONNECT) - 1) == 0 ){
	    	if(esp8266_wps_connect()){
	        	menu_status = wifi_connected;
	    	}else{
	        	menu_status = wifi_not_connected;
	    	}
			curPath[0] = '\0';
			HAL_Delay(2000);
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WIFI_MANGER, sizeof(MENU_TEXT_WIFI_MANGER) - 1) == 0 ){
			menu_status = done;
			esp8266_AT_WiFiManager();
	    	curPath[0] = '\0';
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_ESP8266_RESTORE, sizeof(MENU_TEXT_ESP8266_RESTORE) - 1) == 0 ){
	    	if(esp8266_reset(TRUE)){
	        	menu_status = done;
	    	}else{
	        	menu_status = failed;
	    	}
			curPath[0] = '\0';

