Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	if (cart_type.base_type != base_type_None)
		cart_size_bytes = d->filesize;

	return cart_type;
}




/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(CART_TYPE cart_type, MENU_ENTRY *d)
{
	int offset = 0;
	if (cart_type.withPlusFunctions == TRUE ){
 		// Read path and hostname in ROM File from where NMI points to till '\0' and
		// copy to http_request_header
		offset = esp8266_PlusROM_API_connect(cart_size_bytes);
	}

	if (cart_type.base_type == base_type_2K){
		memcpy(buffer+0x800, buffer, 0x800);
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x2000, 0x0000, cart_type.withSuperChip);
	}else if (cart_type.base_type == base_type_4K )
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x2000, 0x0000, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F8)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FF8, 0x1FF9, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F6)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FF6, 0x1FF9, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F4)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FF4, 0x1FFB, cart_type.withSuperChip );
	else if (cart_type.base_type == base_type_FE)
		emulate_FE_cartridge();
	else if (cart_type.base_type == base_type_3F)
		emulate_3F_cartridge();
	else if (cart_type.base_type == base_type_3E)
		emulate_3E_cartridge(offset, cart_type.withPlusFunctions);
	else if (cart_type.base_type == base_type_E0)
		emulate_E0_cartridge();
	else if (cart_type.base_type == base_type_0840)
		emulate_0840_cartridge();
	else if (cart_type.base_type == base_type_CV)
		emulate_CV_cartridge();
	else if (cart_type.base_type == base_type_EF)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FE0, 0x1FEF, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F0)
		emulate_F0_cartridge();
	else if (cart_type.base_type == base_type_FA)
		emulate_FA_cartridge();
	else if (cart_type.base_type == base_type_E7)
		emulate_E7_cartridge();
	else if (cart_type.base_type == base_type_DPC)
		emulate_DPC_cartridge((uint32_t)cart_size_bytes);
	else if (cart_type.base_type == base_type_AR)
		emulate_ar_cartridge(curPath, cart_size_bytes, buffer, user_settings.tv_mode);
	else if (cart_type.base_type == base_type_PP)
		emulate_pp_cartridge( buffer + 8*1024);
	else if (cart_type.base_type == base_type_DF)
		emulate_df_cartridge(curPath, cart_size_bytes, buffer, d);
	else if (cart_type.base_type == base_type_DFSC)
		emulate_dfsc_cartridge(curPath, cart_size_bytes, buffer, d);
	else if (cart_type.base_type == base_type_BF)
		emulate_bf_cartridge(curPath, cart_size_bytes, buffer, d);
	else if (cart_type.base_type == base_type_BFSC)
		emulate_bfsc_cartridge(curPath, cart_size_bytes, buffer, d);
	else if (cart_type.base_type == base_type_3EPlus)
		emulate_3EPlus_cartridge(offset, cart_type.withPlusFunctions);
	else if (cart_type.base_type == base_type_SB)
		emulate_SB_cartridge(curPath, cart_size_bytes, buffer, d);

}

void truncate_curPath(){
    int len = strlen(curPath);
  	while (len && curPath[--len] != '/');
  	curPath[len] = 0;
}

void system_secondary_init(void){
	set_menu_status_byte(StatusByteReboot, 0);
	generate_udid_string();
	MX_USART1_UART_Init();
	esp8266_init();
	// set up status area
}

void append_entry_to_path(MENU_ENTRY *d){

	if(d->type == Cart_File || d->type == Sub_Menu	){
	    char encode_chars[] = " =+&#%";
	    int i = 0, t, len = strlen(d->entryname);
	    char tmp[] = "00";
	    while(i < len){
	        if(strchr(encode_chars, d->entryname[i])) {
		        t = 1;
		        uint8_t seq = (uint8_t)d->entryname[i];
	        	do {
	        		tmp[t] = (seq % 16) + '0';
	        		if (tmp[t] > '9')
	        		    tmp[t] += 7;
	        		t--;
	        		seq /= 16;
	        	} while (seq);
	            strcat(curPath, "%");
	            strcat(curPath, tmp);

	        }else{
	            strncat(curPath, &d->entryname[i], 1);
	        }
	        i++;
	    }
	}else{
		strcat(curPath, d->entryname);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

	uint8_t act_page = 0;
    MENU_ENTRY *d = &menu_entries[0];
	char input_field[STATUS_MESSAGE_LENGTH + 1];

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();

  /* USER CODE BEGIN 2 */

  user_settings = flash_get_eeprom_user_settings();
  set_tv_mode(user_settings.tv_mode);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
    int ret = emulate_firmware_cartridge();
    enum e_status_message menu_status = none, main_status = none;
    if (ret == CART_CMD_ROOT_DIR){
      d->type = Root_Menu;
      d->filesize = 0;

   	  system_secondary_init();

   	  input_field[0] = 0;
      curPath[0] = 0;
      menu_status = buildMenuFromPath( d );
    } else if(ret == CART_CMD_PAGE_DOWN ) {
    	act_page--;
    } else if(ret == CART_CMD_PAGE_UP ) {
    	act_page++;
    } else {
    	ret += act_page * NUM_MENU_ITEMS_PER_PAGE;
      d = &menu_entries[ret];
      if (d->type == Cart_File || d->type == Offline_Cart_File){
    	// selection is a rom file
    	uint32_t max_romsize = (((BUFFER_SIZE + CCM_RAM_SIZE) * 1024) + (12 - user_settings.first_free_flash_sector) * 128 * 1024 );
    	if(d->filesize > max_romsize ){
    		main_status = not_enough_menory;
    	}else{
    		CART_TYPE cart_type = identify_cartridge(d);
            HAL_Delay(200);
            if (cart_type.base_type == base_type_ACE){
            	main_status = romtype_ACE_unsupported;
            }else if (cart_type.base_type == base_type_DPCplus){
            	main_status = romtype_DPCplus_unsupported;
            }else if (cart_type.base_type != base_type_None){
                emulate_cartridge(cart_type, d);
            }else{
            	main_status = romtype_unknown;
            }
    	}

    	truncate_curPath();

      } else {
        // selection is a directory or Menu_Action, or Keyboard_Char
  		if (d->type == Leave_Menu){
  		  // go back clear_curPath();//
  		  truncate_curPath();
  		  input_field[0] = 0; // Reset Keyboard input field
  		} else if(d->type == Delete_Keyboard_Char){
    		  int len = strlen(curPath);
    		  if(len && curPath[--len] != '/' ){
    	  		  curPath[len] = 0;
    		  }
    		  len = strlen((char *) input_field);
    		  if(len){
    			  input_field[--len] = 0;
    		  }
  	    	  main_status = keyboard_input;
  		} else {
  		  // go into Menu TODO find better way for separation of first keyboard char!!
  		  if( ( d->type != Keyboard_Char && strlen(curPath) > 0)
  			   || strcmp(MENU_TEXT_SETUP"/"MENU_TEXT_PLUS_CONNECT, curPath) == 0
			   || strcmp(MENU_TEXT_SEARCH_ROM, curPath) == 0 ){
    		    strcat(curPath, "/");
  		  }

  		  append_entry_to_path(d);
  		  if(d->type == Keyboard_Char){
  			  strcat((char *)input_field, d->entryname);
  			  if(strlen((char *)input_field) > STATUS_MESSAGE_LENGTH){
  	  			  for(int i = 0 ; i < STATUS_MESSAGE_LENGTH; i++){
  	  				input_field[i] = input_field[i + 1];
  	  			  }
  			  }
  	    	  main_status = keyboard_input;
  		  }else if(d->type == Menu_Action){
  			input_field[0] = 0;
  		  }
  	    }
  		menu_status = buildMenuFromPath( d );
      }
    }

    // Menu status message and PageType byte
    main_status = (main_status != none)?main_status:menu_status;
    if(main_status == keyboard_input){
    	set_menu_status_msg((char *)input_field);
    	set_menu_status_byte((uint8_t)PageType, (char)Keyboard);
    }else{
    	if(main_status != none){
        	set_menu_status_msg(status_message[main_status]);
    	}
    	if(act_page > (num_menu_entries / NUM_MENU_ITEMS_PER_PAGE) ){
    		act_page = 0;
    	}
    	set_menu_status_byte(PageType, Directory);
    }
    _Bool paging_required = (main_status == paging);
    _Bool is_connected = esp8266_is_connected();

    createMenuForAtari( menu_entries, act_page, num_menu_entries, paging_required, is_connected, plus_store_status );
    HAL_Delay(200);
    /* USER CODE END WHILE */

